;信息文件版本:10
[TaskForcesS]
U=(未知)
-1=-1 默认值,随意的队形
-40094=-40094 在最近的威胁区域附近集合
[ScriptTypesCommandS]
0=0 攻击物体,下拉菜单,ScriptTypesCommand0,类型:
;1=1 攻击路径点,数字, ,路径点(必须有路径点):
2=2 使机器人类型兵种进入疯狂状态,默认,0
;3=3 移动到路径点,数字, ,路径点(必须有路径点):
5=5 进入警戒状态,数字, ,时间(单位:6秒):
6=6 跳转到动作,数字, ,行数:
8=8 卸载运输单位,下拉菜单,ScriptTypesCommand8,类型:
9=9 使单位部署,默认,0
10=10 跟随距离最近的友好单位,默认,0
11=11 执行命令,下拉菜单,ScriptTypesCommand11,命令:
14=14 运输全部单位,默认,0
;16=16 在路径点附近巡逻,数字, ,路径点(必须有路径点):
21=21 分散部队,默认,0
30=30 出售所有建筑并进攻,默认,0
31=31 自杀(估计用不到),默认,0
46=46 攻击特定建筑,特定1
47=47 移动到特定建筑附近,特定1
48=48 侦察,默认,0
49=49 前个动作完成后再进行下个动作,默认,0
53=53 集中火力到敌方基地(快慢协调),默认,0
54=54 在己方基地集合,默认,0
55=55 罩上铁幕,默认,0
57=57 超时空到对方建筑附近,下拉菜单,ScriptTypesCommand0,类型:
58=58 移动到友好建筑附近,特定1
60=60 进入部队回收厂(YURI),默认,0
61=61 进入坦克碉堡(YURI),默认,0
62=62 进入生化反应堆(YURI),默认,0
63=63 进入战斗碉堡(YURI),默认,0
64=64 进驻建筑(YURI),默认,0
[ScriptTypesCommand0]
U=(未知)
0=0 什么也不攻击(估计用不到)
1=1 任何单位
2=2 任何建筑
3=3 矿石精炼厂(Harvester:yes)
4=4 步兵单位
5=5 战车单位
6=6 工厂类建筑
7=7 防御类建筑(IsBaseDefense:yes)
8=8 超级武器
9=9 发电厂类建筑
10=10 可进驻建筑
11=11 科技建筑类
[ScriptTypesCommand8]
0=0 保留所有
1=1 保留运输工具
2=2 保留单位(推荐)
3=3 全部解散
[ScriptTypesCommand11]
0=0 啥也不干
1=1 (通过威胁等级)执行AI中的攻击任务
2=2 移动到目的地
3=3 跟随另一队移动
4=4 撤退
5=5 保护目标,攻击进攻的敌人
6=6 保护目标,但穷寇末追
7=7 进入建筑或运输工具
8=8 工程师占领
9=9 Eaten,when object is being repaired (Applies only to structures);在修理单位时,把他吃了,估计是尤里的变卖场(只能用于建筑)
10=10 让矿车采矿卸货
11=11 守卫周围地区
12=12 航母载机回巢
13=13 停止移动或攻击(有可能的话)
14=14 伏击
15=15 游击
16=16 卸货
17=17 安放炸弹
18=18 建立建筑
19=19 卖掉建筑
20=20 进入维修厂修理车辆
21=21 Rescue,special team over-ride mission;拯救
22=22 发射核弹
23=23 无威胁目标
24=24 开门关门
25=25 巡逻
26=26 空降机飞行
27=27 空降机空投
28=28 待命
29=29 空间跳跃
30=30 展开攻击
31=31 侦察机飞行(YURI)
32=32 侦察机照相(YURI)
[TeamTypesS]
0=无法心灵控制别人
1=加入另外需要的队伍
2=放进部队回收站
3=放进生化反应堆
4=攻击敌人
5=就在原地
[AITriggerTypes1]
-1=-1 普通触发
0=0 敌人拥有[X]物品
1=1 自己拥有[X]物品
2=2 敌人电量正常
3=3 敌人电量不足
4=4 敌人金钱超过数量
5=5 铁幕装置就绪
6=6 超时空传送仪就绪
7=7 中立方拥有[X]物品
[AITriggerTypes2]
U=(未知)
0=小于
1=小于等于
2=等于
3=大于等于
4=大于
5=不等于
[TeamTypesNote]
Name=名字,一般无实际意义,只做注释
VeteranLevel=星级数
MindControlDecision=在尤里复仇中,电脑的尤里方控制别人后的动作:\n0.无法心灵控制别人\n1.加入另外需要的队伍\n2.放进部队回收站\n3.放进生化反应堆\n4.前去攻击敌人\n5.就在原地
Loadable=部队攻击完后是否撤退,待会再攻击(一般使用在像飞机那样需要补充弹药的部队里)
Full=完整小队
Annoyance=烦恼效果
GuardSlower=防卫减缓
Recruiter=是否优先使用现有的单位来组成队伍
Prebuild=是否预先建造
Reinforce=是否为增援部队
Droppod=是否为空降部队
UseTransportOrigin=是否使用存在的运输工具
TransportsReturnOnUnload=运输单位在完成卸载后是否返回基地
Whiner=哀叫效果
LooseRecruit=当前的部队完成任务后是否解散(而不会加入另一队中)
Aggressive=是否执行脚本
Suicide=是否为自杀性攻击部队
Priority=优先权
Max=最多
TechLevel=科技等级
Group=分组
OnTransOnly=是否为传送部队
AvoidThreats=是否忽略任何攻击继续前进
AreTeamMembersRecruitable=可以为该组部队补充队伍中被消灭的成员
IsBaseDefense=是否为防御部队
OnlyTargetHouseEnemy=是否不攻击中立部队
IonImmune=默认[NO]
[Unit]
E1=E1 美国大兵
ADOG=ADOG 盟军警犬
ENGINEER=ENGINEER 盟军工程师
GGI=GGI 重装大兵(YURI)
JUMPJET=JUMPJET 火箭飞行兵
SPY=SPY 间谍
GHOST=GHOST 海豹部队
TANY=TANY 谭雅
CLEG=CLEG 超时空军团兵
CCOMAND=CCOMAND 超时空突击队
PTROOP=PTROOP 心灵突击队
SNIPE=SNIPE 狙击手
E2=E2 动员兵
DOG=DOG 苏军警犬
FLAKT=FLAKT 防空步兵
SENGINEER=SENGINEER 苏军工程师
SHK=SHK 磁爆步兵
IVAN=IVAN 疯狂伊文
CIVAN=CIVAN 超时空伊文
TERROR=TERROR 恐怖分子
DESO=DESO 辐射工兵
YURI=YURI 尤里
YURIPR=YURIPR 尤里改(RA2)
PTROOP=PTROOP 超能力部隊
CCOMAND=CCOMAND 超时空突袭队
BORIS=BORIS 精英战斗兵(YURI)
INIT=INIT 尤里新兵(YURI)
BRUTE=BRUTE 狂兽人(YURI)
SLAV=SLAV 奴隶(YURI)
YENGINEER=YENGINEER 尤里工程师(YURI)
VIRUS=VIRUS 病毒狙击手(YURI)
YURIPR=YURIPR 尤里X(YURI)
LUNR=LUNR 登月火箭员(YURI)
ARND=ARND 魔鬼终结者(YURI)
CLNT=CLNT Westwood 之星(YURI)
STLN=STLN 蓝波(YURI)
MTNK=MTNK 灰熊坦克
FV=FV 多功能步兵车
MGTK=MGTK 幻影坦克
SREF=SREF 光陵坦克
TNKD=TNKD 坦克杀手
AMCV=AMCV 盟军基地车
CMIN=CMIN 超时空采矿车
HTNK=HTNK 犀牛坦克
DRON=DRON 恐怖机器人
HTK=HTK 防空履带车
V3=V3 V3火箭
APOC=APOC 天启坦克
SMCV=SMCV 苏军基地车
HARV=HARV 武装采矿车
ZEP=ZEP 基洛夫空艇
TTNK=TTNK 磁能坦克
DTRUCK=DTRUCK 自爆卡车
HOWI=HOWI 榴弹炮
LTNK=LTNK 轻坦克(RA2)
LTNK=LTNK 狂风坦克(YURI)
PCV=PCV 尤里机动基地车(YURI)
MIND=MIND 精神控制车(YURI)
YTNK=YTNK 盖特机炮坦克(YURI)
CAOS=CAOS 精神突袭车(YURI)
TELE=TELE 磁电坦克(YURI)
DISK=DISK 镭射幽浮(YURI)
BFRT=BFRT 战斗要塞(YURI)
ROBO=ROBO 遥控坦克(YURI)
DEST=DEST 驱逐舰
DLPH=DLPH 海豚
AEGIS=AEGIS 神盾巡洋舰
CARRIER=CARRIER 航空母舰
SAPC=SAPC 装甲运兵船
HYD=HYD 海蝎
SUB=SUB 攻击潜艇
SQD=SQD 巨型乌贼
DRED=DRED 无畏级战舰
YHVR=YHVR 尤里装甲运兵船(YURI)
BSUB=BSUB 雷鸣潜艇(YURI)
BEAG=BEAG 黑鹰战机
SHAD=SHAD 夜鹰直升机
ORCA=ORCA 入侵者战机
YDOG=YDOG 尤里警犬
[Building]
GAPOWR=盟军发电厂
GAREFN=盟军矿石精炼厂
GAPILE=盟军兵营
GAWEAP=盟军战车工厂
GAAIRC=盟军空指部
AMRADR=美国空指部
GADEPT=盟军维修厂
GAYARD=盟军造船厂
GATECH=盟军作战实验室
GAROBO=控制中心(YURI)
GAOREP=矿石精练器
GAWALL=盟军围墙
GAPILL=机枪碉堡
NASAM=爱国者飞弹
GAGAP=裂缝产生器
ATESLA=光棱塔
GASPYSAT=间谍卫星
GACNST=盟军建造场
GTGCAN=巨炮
GACSPH=超时空传送仪
GAWEAT=天气控制器
NAPOWR=磁能反应炉
NAREFN=苏军矿厂
NAHAND=苏军兵营
NAWEAP=苏军战车工厂
NARADR=苏军雷达
NADEPT=苏军维修厂
NAYARD=苏军船厂
NATECH=苏军作战实验室
NANRCT=核子反应堆
NAINDP=工业工厂(YURI)
NAWALL=苏军围墙
NABNKR=战斗碉堡(YURI)
NALASR=哨戒炮
NAFLAK=防空炮
TESLA=磁暴线圈
NACNST=苏军建造厂
NAIRON=铁幕装置
NAMISL=核弹发射井
YAPOWR=生化反应炉(YURI)
YAREFN=奴隶矿厂(YURI)
YABRCK=尤里兵营(YURI)
YAWEAP=尤里战车工厂(YURI)
NAPSIS=心灵感应器
YAYARD=尤里船厂(YURI)
YAGRND=部队回收厂(YURI)
YATECH=尤里作战实验室(YURI)
GAFWLL=尤里围墙(YURI)
NATBNK=坦克碉堡(YURI)
YAGGUN=盖特机炮(YURI)
YAPSYT=心灵控制塔(YURI)
NACLON=复制中心
YAGNTC=基因突变器(YURI)
YAPPET=心灵控制器(YURI)
YACNST=尤里建造场(YURI)
CAAIRP=科技机场
CAMACH=科技机器商店
CAOUTP=科技前哨站
CAPOWR=科技电厂
CASLAB=秘密科技实验室
CAHOSP=市民医院(RA2)
CATHOSP=科技医院(YURI)
[Sides] ;;;;;;;;;;;;
0=0 以下全部
1=1 盟军
2=2 苏军
3=3 尤里